Revit 2027 API
AnalyticalCurveSelector Enumeration
 Specifies which portion of an Analytical Curve is of interest.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalyticalCurveSelector
Public Enumeration AnalyticalCurveSelector
public enum class AnalyticalCurveSelector
type AnalyticalCurveSelector
Members
Member name | Value | Description
EndPoint | 1 |  End of curve (corresponds to end = 1).
StartPoint | 0 |  Start of curve (corresponds to end = 0).
WholeCurve | 2 |  Entire curve.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace